In [3]:
import pandas as pd
import numpy as np

In [4]:
obj=pd.Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [5]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','d','b','c'])
frame.sort_index()

       d  d  b  c
one    4  5  6  7
three  0  1  2  3

In [7]:
frame.sort_index(axis=1)

       b  c  d  d
three  2  3  0  1
one    6  7  4  5

In [13]:
frame.sort_index(axis=1,ascending=False)

       d  d  c  b
three  0  1  3  2
one    4  5  7  6

In [15]:
obj=pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [16]:
obj=pd.Series([4, np.nan, 7, np.nan,-3,2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [17]:
frame=pd.DataFrame({'a':[0,1,0,1],'b':[4,7,-3,2]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [18]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [19]:
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [20]:
obj=pd.Series([7,-5,7,4,7,2,0,4])
obj.rank()

0    7.0
1    1.0
2    7.0
3    4.5
4    7.0
5    3.0
6    2.0
7    4.5
dtype: float64

In [21]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    8.0
5    3.0
6    2.0
7    5.0
dtype: float64

In [22]:
obj.rank(ascending=False,method='max')

0    3.0
1    8.0
2    3.0
3    5.0
4    3.0
5    6.0
6    7.0
7    5.0
dtype: float64

In [27]:
frame=pd.DataFrame({'a':[0,1,0,1],'b':[4.3,7,-3,2],'c':[-2,5,8,-2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [28]:
frame.rank(axis='columns')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0